{"class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"trainable": true, "dtype": "float32", "name": "masking_1", "batch_input_shape": [null, 3, 13], "mask_value": -1}}, {"class_name": "LSTM", "config": {"name": "lstm_1", "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "unit_forget_bias": true, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "dropout": 0.2, "activation": "tanh", "unroll": false, "recurrent_dropout": 0.0, "use_bias": true, "implementation": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "dtype": "float32", "recurrent_regularizer": null, "return_state": false, "stateful": false, "units": 32, "batch_input_shape": [null, 3, 13], "kernel_regularizer": null, "go_backwards": false, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "dtype": "float32", "activation": "linear", "trainable": true, "activity_regularizer": null, "name": "dense_1", "batch_input_shape": [null, 32], "kernel_regularizer": null, "use_bias": true, "units": 7, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}], "keras_version": "2.1.5", "backend": "tensorflow"}