{"config": [{"config": {"batch_input_shape": [null, 3, 13], "trainable": true, "mask_value": -1, "dtype": "float32", "name": "masking_1"}, "class_name": "Masking"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "dtype": "float32", "go_backwards": false, "recurrent_constraint": null, "dropout": 0.2, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "name": "lstm_1", "trainable": true, "stateful": false, "bias_constraint": null, "use_bias": true, "unroll": false, "recurrent_activation": "hard_sigmoid", "units": 32, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "return_sequences": false, "return_state": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "implementation": 1, "batch_input_shape": [null, 3, 13], "unit_forget_bias": true, "kernel_constraint": null}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "kernel_regularizer": null, "activation": "linear", "units": 7, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "batch_input_shape": [null, 32], "bias_constraint": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.5"}